set language 'English'
USE DreamHomeKlinduhov

GO

INSERT INTO BRANCH (Postcode, City, Street, House, Btel_no, Fax_no)
VALUES (210009, 'Витебск', 'Замковая', '4/офис404', '8(01722)37-73-56', '37-73-58'),
(210033, 'Витебск', 'Суворова', '9/11', '8(01722)36-01-80', '33-25-23'),
(211440, 'Новополоцк', 'Молодежная', '18', '8(01744)57-31-29', '57-25-30'),
(211460, 'Россоны', 'Ленина', '3', '8(01759)25-55-20', NULL)

GO

INSERT INTO OWNER (LName, FName, City, Street, House, Flat, Otel_no)
VALUES ('Жерносек', 'Юрий', 'Витебск', 'Терешковой', '28/1', 7, '62-07-94'),
('Панкратова', 'Инна', 'Новополоцк', 'Парковая', '2б', 12, '57-12-48'),
('Амбражевич', 'Сергей', 'Витебск', 'Двинская', '5', 18, '52-14-89'),
('Поскрёбышева', 'Елена', 'Витебск', 'П.Бровки', '26/1', 40, '23-00-72(аб978)'),
('Титов', 'Николай', 'Витебск', 'Интернационалистов', '35', 187, '8(029)633-76-68'),
('Скребкова', 'Алла', 'Новополоцк', 'Молодёжная', '1', 22, '8(029)688-84-46'),
('Николаев', 'Влад', 'Витебск', 'Фрунзе', '33', 214, '8(029)673-07-30'),
('Цалко', 'Сергей', 'Лепель', 'Ленина', '14/2', 4, '25-17-90'),
('Цыркунова', 'Наталья', 'Россоны', 'Цветочная', '90', 15, '26-32-48'),
('Яковлев', 'Андрей', 'Витебск', 'Лазо', '65', NULL, '21-72-25')


GO

INSERT INTO BUYER (LName, Fname, City, Street, House, Flat, Htel_no, Wtel_no, Prof_rooms, Max_Price, Branch_no)
VALUES ('Невердасов', 'Виктор', 'Витебск', 'Московский пр-т', '16/4', 117, '62-08-19', '36-40-80', 2, 110000, 2),
('Кассап', 'Светлана', 'Новополоцк', 'Гайдара', '17а', 4, '57-12-48', NULL, 1, 78000, 3),
('Орлов', 'Александр', 'Минск', 'Либнехта', '93', 15, '8(017)286-13-21', NULL, 3, 14500, 1),
('Сафронова', 'Светлана', 'Витебск', 'пр-т Победы', '3/1', 324, '8(029)661-07-30', '22-67-94', 2, 60000, 4),
('Окорков', 'Вадим', 'Минск', 'Лермонтова', '35', 187, NULL, '8(017)224-84-24', 5, 300000, 1),
('Семёнов', 'Вячеслав', 'Витебск', 'Замковая', '4', 13, '23-00-72(аб964)', NULL, 2, 10500, 1),
('Краснова', 'Жанна', 'Витебск', 'Клиническая', '104', NULL, NULL, '23-50-70', 1, 90000, 2),
('Будда', 'Елена', 'Лепель', 'Ленина', '3', 5, '62-08-19', NULL, 4, 200000, 3),
('Боровая', 'Наталья', 'Орша', 'Смоленская', '12/4', 26, '26-32-48', NULL, 2, 140000, 2),
('Алипов', 'Игорь', 'Витебск', 'Московский пр-т', '22', 4, '21-72-25', NULL, 3, 150000, 2)



GO

INSERT INTO STAFF (LName, Fname, DOB, Sex, City, Street, House, Flat, STel_no, Date_Joined, Position, Salary, Branch_no)
VALUES ('Батуркин', 'Александр', CONVERT(DATETIME, '1968-10-17'), 'м', 'Новополоцк', 'Парковая', '5', 13, '23-79-77', CONVERT(DATETIME, '2001-01-01'), 'менеджер', 2500000, 3),
('Чубаро', 'Наталья', CONVERT(DATETIME, '1972-05-25'), 'ж', 'Витебск', 'Чкалова', '21/1', 12, '8(029)662-47-32', CONVERT(DATETIME, '2002-02-10'), 'торговый агент', 1800000, 1),
('Коваленко', 'Светлана', CONVERT(DATETIME, '1970-02-01'), 'ж', 'Витебск', 'Чкалова', '24', 49, '62-51-23', CONVERT(DATETIME, '2001-01-15'), 'менеджер', 2500000, 3),
('Логинов', 'Вадим', CONVERT(DATETIME, '1967-09-09'), 'м', 'Витебск', 'Чкалова', '41/2', 96, '23-06-73', CONVERT(DATETIME, '1999-09-02'), 'директор', 3000000, 1),
('Суворов', 'Виталий', CONVERT(DATETIME, '1965-11-07'), 'м', 'Новополоцк', 'Школьная', '47/1', 157, '22-29-03', CONVERT(DATETIME, '1999-02-01'), 'торговый агент', 1800000, 3),
('Жарков', 'Герман', CONVERT(DATETIME, '1969-11-05'), 'м', 'Витебск', 'Гагарина', '31', 28, '63-43-98', CONVERT(DATETIME, '2001-10-02'), 'менеджер', 2800000, 2),
('Ганущенко', 'Галина', CONVERT(DATETIME, '1969-11-05'), 'ж', 'Витебск', 'Лазо', '90/1', 54, '62-43-64', CONVERT(DATETIME, '2004-11-03'), 'торговый агент', 1800000, 2),
('Сотникова', 'Ольга', CONVERT(DATETIME, '1967-12-07'), 'ж', 'Полоцк', 'Вокзальная', '7', NULL, NULL, CONVERT(DATETIME, '2002-02-02'), 'маклер', 1000000, 3),
('Янчиленко', 'Сергей', CONVERT(DATETIME, '1970-02-28'), 'м', 'Россоны', 'Ленина', '28/2', 25, NULL, CONVERT(DATETIME, '2005-05-17'), 'торговый агент', 1500000, 4)

GO

INSERT INTO PROPERTY (Property_no, Date_registration, Postcode, City, Street, House, Flat, Floor_type, Floor_n, Rooms, The_area, Balcony, Ptel, Selling_Price, Branch_no, Staff_no, Owner_no)
VALUES (3000, CONVERT(DATETIME, '1972-05-25'), '210033', 'Витебск', 'Смоленская', '11', 57, '5П', 3, 1, '31/18/10', 'Б', 'T', 60000, 1, 3, 1),
(3001, CONVERT(DATETIME, '2018-12-17'), '210035', 'Витебск', 'Бровки', '11', 49, '9К', 9, 1, '37/21/7', 'Бз', NULL, 70000, 2, 3, 5),
(3002, CONVERT(DATETIME, '2018-12-11'), '210029', 'Витебск', 'Строителей', '23/2', 214, '12П', 2, 2, '81/29/9', 'Лз', 'T', 92000, 2, 6, 7),
(3003, CONVERT(DATETIME, '2018-12-19'), '210005', 'Витебск', 'Лазо', '11', 4, '3К', 3, 2, '65/40/7,6', '2Бз', NULL, 15000, 1, 2, 5),
(3004, CONVERT(DATETIME, '2018-12-15'), '211460', 'Россоны', 'Ленина', '32', 20, '5П', 5, 3, '68,4/44,3/9,81', '2Бз', 'T', 100000, 4, 8, 7),
(3005, CONVERT(DATETIME, '2018-12-11'), '211440', 'Новопол', 'Школьная', '11', 56, '9П', 3, 1, '36/18/8,2', 'Б', 'T', 75000, 3, 1, 6),
(3006, CONVERT(DATETIME, '2018-12-14'), '211440', 'Новопол', 'Молодёжная', '5', 14, '9П', 2, 2, '46/27/6,8', 'Лз', 'T', 60000, 3, 4, 3),
(3007, CONVERT(DATETIME, '2018-12-20'), '211180', 'Полоцк', 'Вокзальная', '5', 15, '5К', 5, 3, '65/38/7', 'Б', 'T', 80000, 3, 7, 2),
(3008, CONVERT(DATETIME, '2018-01-16'), '211460', 'Россоны', 'Советская', '17', 1, '5К',1, 3, '65/38/7', NULL, 'T', 47500, 4, 8, 7)

GO

INSERT INTO VIEWING (Date_View, Comments, Property_no, Buyer_no)
VALUES 
(CONVERT(DATETIME, '2019-01-17'), 'Согласен', 3002, 1),
(CONVERT(DATETIME, '2019-01-17'), 'Согласен', 3003, 1),
(CONVERT(DATETIME, '2019-01-17'), 'не согласен', 3002, 4),
(CONVERT(DATETIME, '2019-01-17'), 'Согласен', 3005, 2),
(CONVERT(DATETIME, '2019-01-17'), 'требует ремонта', 3001, 7)

GO

INSERT INTO CONTRACT (Property_no, Buyer_no, Date_Contract, Service_Cost)
VALUES 
(3002, 1, CONVERT(DATETIME, '2019-01-17'), 10000),
(3003, 1, CONVERT(DATETIME, '2019-01-17'), 15000),
(3005, 2, CONVERT(DATETIME, '2019-01-17'), 80000)